In [1]:
#pip install mysql
#pip install sqlalchemy

In [2]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine , text
import os

In [3]:
#import sql to python

engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit") 
print(engine1)

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [4]:
def q(sql, **params):
    with engine1.connect() as conn:
        return pd.read_sql(text(sql), conn, params=params)

In [28]:
q("SHOW DATABASES")

             Database
0  information_schema
1  performance_schema
2                piit

In [30]:
q('show tables')

  Tables_in_piit
0    departments
1       empdata2
2      employees
3         mtcars
4      students2

In [9]:
q("SELECT * FROM empdata2")

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  55000.0
1            2       Jane     Smith         IT  11111.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4          101       John       Doe         HR  50000.0
5          102       Jane     Smith         IT  60000.0
6          103      Alice   Johnson    Finance  55000.0
7          104        Bob  Williams         IT  62000.0
8          105      Emily      Akki         HR  48000.0

In [11]:
q("select * from empdata2 where department = 'HR'")

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  55000.0
1          101       John       Doe         HR  50000.0
2          105      Emily      Akki         HR  48000.0

In [12]:
q("select * from empdata2 where first_name = 'John'")

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  55000.0
1          101       John       Doe         HR  50000.0

In [13]:
q("select distinct department from empdata2")

  department
0         HR
1         IT
2    Finance

In [15]:
q("select distinct employee_id from empdata2")

   employee_id
0            1
1            2
2            3
3            4
4          101
5          102
6          103
7          104
8          105

In [17]:
q("SELECT * FROM empdata2 WHERE salary > 55000.00;")

   employee_id first_name last_name department   salary
0            4        Bob  Williams         IT  62000.0
1          102       Jane     Smith         IT  60000.0
2          104        Bob  Williams         IT  62000.0

In [18]:
q('SELECT * FROM empdata2 LIMIT 3')

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  55000.0
1            2       Jane     Smith         IT  11111.0
2            3      Alice   Johnson    Finance  55000.0

In [19]:
q('SELECT * FROM empdata2 LIMIT 5 OFFSET 2')

   employee_id first_name last_name department   salary
0            3      Alice   Johnson    Finance  55000.0
1            4        Bob  Williams         IT  62000.0
2          101       John       Doe         HR  50000.0
3          102       Jane     Smith         IT  60000.0
4          103      Alice   Johnson    Finance  55000.0

In [25]:
df = q("SELECT * FROM empdata2 WHERE employee_id = :id", id=1)
print(df)

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  11111.0

In [ ]:
q('UPDATE empdata2 SET salary = 11111.0 WHERE employee_id = 1')

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [ ]:
q("UPDATE empdata2 SET salary = :salary WHERE employee_id = :id", salary=11111.0, employee_id=1)

StatementError: (sqlalchemy.exc.InvalidRequestError) A value is required for bind parameter 'id'
[SQL: UPDATE empdata2 SET salary = %(salary)s WHERE employee_id = %(id)s]
[parameters: [{'salary': 11111.0, 'employee_id': 1}]]
(Background on this error at: https://sqlalche.me/e/14/cd3x)